I upgraded to the latest version, i.e. 0.0.49, but the problem persists, I have not changed a single line of my terraform code, but there is diff.

![image](https://user-images.githubusercontent.com/38343778/218614660-f21d0643-81b1-4aa0-8c23-3885aae13357.png)

```plain
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.bytesbc-boe.volcengine_vke_cluster.bytesbc_boe must be replaced
-/+ resource "volcengine_vke_cluster" "bytesbc_boe" {
      ~ eip_allocation_id         = "eip-3qecv9i03yvwg7prml01jhif9" -> (known after apply)
      ~ id                        = "ccfl45k7qtofjm6lh6c4g" -> (known after apply)
      + kubeconfig_private        = (known after apply)
      + kubeconfig_public         = (known after apply)
      ~ kubernetes_version        = "v1.24.8-vke.4" -> "1.24"
        name                      = "bytesbc-boe"
        # (2 unchanged attributes hidden)

      ~ pods_config {
            # (1 unchanged attribute hidden)

          ~ vpc_cni_config {
              + vpc_id     = "vpc-5gexv9f2rz7k73inqkau79zr" # forces replacement
                # (1 unchanged attribute hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

Wait, is it possible that the diff is not caused by `kubernetes_version` but by `pods_config.vpc_cni_config.vpc_cni_config`?


But I haven't changed the configuration of `pods_config.vpc_cni_config.vpc_cni_config`.


```hcl
  pods_config {
    pod_network_mode = "VpcCniShared"

    vpc_cni_config {
      vpc_id = volcengine_vpc.bytesbc_boe.id

      subnet_ids = [
        volcengine_subnet.bytesbc_boe_subnet_pod_a.id,
        volcengine_subnet.bytesbc_boe_subnet_pod_b.id,
      ]
    }
  }
```

For reference, the configuration of `pods_config` is in the code above.
